#include <stdio.h>

int main(void)
{
    int a = 10, b = 010, c = 0x10;
    char d = 'A';
    printf(
        "DEC_10: %d\n"
        "OCT_10: %d\n"
        "HEX_10: %d\n"
        "INT_SUFFIX: %d %d %d %d\n"
        "FLOAT_SUFFIX: %d %d %d\n"
        "FLOAT_EQ: %d\n"
        "CHAR_FORMS: %d %d %d\n"
        "CHAR_LIT_VAR_STR: %d %d %d\n",
        a,
        b,
        c,
        sizeof(10), sizeof(10u), sizeof(10LL), sizeof(10ULL),
        sizeof(0.1f), sizeof(0.1), sizeof(0.1L),
        0.1 == 0.1f,
        d, '\x41', '\101',
        sizeof('A'), sizeof(d), sizeof("A")
    );
    return 0;
}
/*Объясните системы счисления целочисленных литералов, роль
суффиксов, почему 0.1f не равно 0.1, и почему символьный литерал в Си
имеет размер int, тогда как переменная типа char занимает один байт.*/

/*Десятичный литерал это число, восьмиричный литерал имеет префикс 0, шестнадцатиричный литерал имеет префикс 0x/0X.*/
/*0.1f и 0.1 задают разную точность представления данного числа из-за двоичной природы данных, при сравнении неявное приведение типов добавляет нули в дробную часть, но это не меняет исходную точность*/
/*Символьный литерал кодируется целым числом, а тип данных char имеет размер 1 байт. В данной задаче прозошло неявное приведение типов. При данном приведении скопировались данные старшего байта от исходных данных.*/
